-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 07 2025 г., 19:02
-- Версия сервера: 8.0.19
-- Версия PHP: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `api`
--

-- --------------------------------------------------------

--
-- Структура таблицы `rates`
--

CREATE TABLE `rates` (
  `id` int NOT NULL,
  `rate_id` int NOT NULL,
  `date` varchar(20) NOT NULL,
  `abbreviation` varchar(3) NOT NULL,
  `scale` varchar(10) NOT NULL,
  `name` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `officialRate` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `rates`
--

INSERT INTO `rates` (`id`, `rate_id`, `date`, `abbreviation`, `scale`, `name`, `officialRate`) VALUES
(1, 440, '2025-01-07T00:00:00', 'AUD', '1', 'Австралийский доллар', '2.1618'),
(2, 510, '2025-01-07T00:00:00', 'AMD', '1000', 'Армянских драмов', '8.6946'),
(3, 441, '2025-01-07T00:00:00', 'BGN', '1', 'Болгарский лев', '1.8511'),
(4, 514, '2025-01-07T00:00:00', 'BRL', '10', 'Бразильских реалов', '5.5784'),
(5, 449, '2025-01-07T00:00:00', 'UAH', '100', 'Гривен', '8.2664'),
(6, 450, '2025-01-07T00:00:00', 'DKK', '10', 'Датских крон', '4.8591'),
(7, 513, '2025-01-07T00:00:00', 'AED', '10', 'Дирхамов ОАЭ', '9.457'),
(8, 431, '2025-01-07T00:00:00', 'USD', '1', 'Доллар США', '3.4735'),
(9, 512, '2025-01-07T00:00:00', 'VND', '100000', 'Донгов', '13.6296'),
(10, 451, '2025-01-07T00:00:00', 'EUR', '1', 'Евро', '3.6246'),
(21, 452, '2025-01-07T00:00:00', 'PLN', '10', 'Злотых', '8.4838'),
(22, 508, '2025-01-07T00:00:00', 'JPY', '100', 'Иен', '2.2'),
(23, 511, '2025-01-07T00:00:00', 'INR', '100', 'Индийских рупий', '4.0606'),
(24, 461, '2025-01-07T00:00:00', 'IRR', '100000', 'Иранских риалов', '8.253'),
(25, 453, '2025-01-07T00:00:00', 'ISK', '100', 'Исландских крон', '2.515'),
(26, 371, '2025-01-07T00:00:00', 'CAD', '1', 'Канадский доллар', '2.4135'),
(27, 462, '2025-01-07T00:00:00', 'CNY', '10', 'Китайских юаней', '4.85'),
(28, 394, '2025-01-07T00:00:00', 'KWD', '1', 'Кувейтский динар', '11.2739'),
(29, 454, '2025-01-07T00:00:00', 'MDL', '10', 'Молдавских леев', '1.8813'),
(30, 448, '2025-01-07T00:00:00', 'NZD', '1', 'Новозеландский доллар', '1.9642'),
(31, 455, '2025-01-07T00:00:00', 'NOK', '10', 'Норвежских крон', '3.0578'),
(32, 456, '2025-01-07T00:00:00', 'RUB', '100', 'Российских рублей', '3.3488'),
(33, 457, '2025-01-07T00:00:00', 'XDR', '1', 'СДР (Специальные права заимствования)', '4.5299'),
(34, 421, '2025-01-07T00:00:00', 'SGD', '1', 'Сингапурcкий доллар', '2.5591'),
(35, 458, '2025-01-07T00:00:00', 'KGS', '100', 'Сомов', '3.9926'),
(36, 459, '2025-01-07T00:00:00', 'KZT', '1000', 'Тенге', '6.6274'),
(37, 460, '2025-01-07T00:00:00', 'TRY', '10', 'Турецких лир', '0.9847'),
(38, 429, '2025-01-07T00:00:00', 'GBP', '1', 'Фунт стерлингов', '4.3695'),
(39, 463, '2025-01-07T00:00:00', 'CZK', '100', 'Чешских крон', '14.3623'),
(40, 464, '2025-01-07T00:00:00', 'SEK', '10', 'Шведских крон', '3.1621'),
(41, 426, '2025-01-07T00:00:00', 'CHF', '1', 'Швейцарский франк', '3.8524');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `rates`
--
ALTER TABLE `rates`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id_and_date` (`rate_id`,`date`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `rates`
--
ALTER TABLE `rates`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=290;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
